package com.shiqian.youknowme;

/**
 * Created by chenzd on 17-12-25.
 */
public class Design {

    /*
    *功能：
    *引导页 Welcome页
    *注册登陆页 LoginRegister
    *功能页KnowMain
    * 大致功能：
    * 1,版本更新；
    * 2,注册登陆
    * 3,Bug追踪
    * 4,地图定位
    * 5,查看当前位置和行动轨迹
    * 6,添加好友，授权查看
    * 7,系统设置页
    * 8,查看具体信息页
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    * */

}
